Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["someguy"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "someguy"
        name                        = "someguy"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

  # github_repository_file.this["choco-go-ipfs/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "choco-go-ipfs/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["go-bitswap/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "go-bitswap/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["go-dagwriter/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "go-dagwriter/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["go-delegated-routing/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "go-delegated-routing/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["go-ipfs-gateway/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "go-ipfs-gateway/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["helia-car/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = <<-EOT
          - feat!: update helia to v3 and multiformats to v13 (#52)
          - 
          - Updates all deps and fixes linting errors.
          - 
          - BREAKING CHANGE: uses multiformats v13 and helia v3
          + chore: Update .github/workflows/stale.yml [skip ci]
        EOT
        id                  = "helia-car/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["ipfs-project.org/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "ipfs-project.org/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-blockstore-core/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-blockstore-core/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-core/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-core/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-datastore-core/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-datastore-core/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-datastore-fs/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-datastore-fs/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-datastore-idb/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-datastore-idb/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-datastore-level/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-datastore-level/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-datastore-s3/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-datastore-s3/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["js-hamt-sharding/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-hamt-sharding"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-ipfs-unixfs/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
        id                  = "js-ipfs-unixfs/.github/workflows/stale.yml"
        # (9 unchanged attributes hidden)
    }

  # github_repository_file.this["js-ipfs/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "js-ipfs/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["notes/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "notes/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["papers/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "papers/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["someguy/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "someguy"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["steering-wg/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "steering-wg"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["tar-utils/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "tar-utils/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

  # github_repository_file.this["team-mgmt/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "team-mgmt/.github/workflows/stale.yml"
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 21 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->